In [3]:
#匯入資料
import pandas as pd
users=pd.read_csv('https://raw.githubusercontent.com/Code-Gym/python-dataset/master/u.user.txt',
                 sep='|',
                 index_col='user_id')

print(users)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

In [5]:
#列印前五筆資料
users.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [7]:
#後五筆
users.tail()

         age gender     occupation zip_code
user_id
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

In [10]:
#資料筆數
users.shape[0]

943

In [11]:
#欄位數量
users.shape[1]

4

In [13]:
#欄位名稱和資料型態
users.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

In [15]:
#指定欄位
users.occupation

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

In [16]:
#列印職業欄中的第一筆資料
users.occupation[1]

'technician'

In [17]:
#有多少不同種類的職業
users.occupation.nunique()

21

In [18]:
#每一種職業的統計數量有多少
users.occupation.value_counts()

student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
salesman          12
lawyer            12
none               9
homemaker          7
doctor             7
Name: occupation, dtype: int64

In [19]:
#出現次數最高的職業是哪一種
users.occupation.value_counts().head(1)

student    196
Name: occupation, dtype: int64

In [20]:
#出現次數最少的是哪一種
users.occupation.value_counts().tail(1)

doctor    7
Name: occupation, dtype: int64

In [21]:
#基本統計資料
users.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

In [22]:
#全部爛位基本統計資料
users.describe(include='all')

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN